Tekla Open API Reference for Tekla Structures 2025
Intersection Methods
The Intersection type exposes the following members.
Methods
Name | Description
LineSegmentToObb
 Returns a new line segment which is an intersection of the given line segment and the oriented bounding box or null if the line segment and oriented bounding box do not intersect.
LineSegmentToPlane
 Returns a new point which is an intersection of the given line segment and plane or null if the line segment and the plane are parallel or do not intersect.
LineToLine
 Returns a new line segment which is the shortest path between the given lines or null if the lines are parallel. If the resulting line segment has a length of 0.0, the given lines actually intersect in 3d space.
LineToObb
 Returns a new line segment which is an intersection of the given line and the oriented bounding box or null if the line and oriented bounding box do not intersect.
LineToPlane
 Returns a new point which is an intersection of the given line and plane or null if the line and the plane are parallel.
PlaneToPlane
 Returns a new line which is an intersection of the given two planes or null if the planes are parallel.
Top
See Also
Reference
Intersection Class
Tekla.Structures.Geometry3d Namespace